# Homebrew Bundle file for macOS package management
# Install with: brew bundle install

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# CLI Tools
brew "git"
brew "tig"
brew "htop"
brew "tree"
brew "nvim"
brew "ack"
brew "fzf"
brew "tmux"
brew "ctags"
brew "wget"
brew "curl"
brew "ripgrep"
brew "asdf"
brew "jq"              # JSON processor
brew "bat"             # Better cat with syntax highlighting
brew "exa"             # Better ls
brew "fd"              # Better find
brew "gh"              # GitHub CLI
brew "mas"             # Mac App Store CLI
brew "autoconf"
brew "bison"
brew "gettext"
brew "openssl"
brew "pkg-config"

# Development tools
brew "docker"
brew "docker-compose"

# GUI Applications
cask "telegram"
cask "vlc"
cask "visual-studio-code"
cask "iterm2"
cask "rectangle"       # Window management
cask "alfred"          # Spotlight replacement
cask "cleanmymac"      # System cleaner

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

# Mac App Store apps
mas "Xcode", id: 497799835
mas "1Password 7", id: 1333542190