# Homebrew Bundle file for macOS package management
# Install with: brew bundle install

# Taps
tap "borkdude/brew"

# CLI Tools
brew "git"
brew "tig"
brew "htop"
brew "tree"
brew "nvim"
brew "ack"
brew "fzf"
brew "tmux"
brew "ctags"
brew "wget"
brew "curl"
brew "ripgrep"
brew "asdf"
brew "jq"              # JSON processor
brew "bat"             # Better cat with syntax highlighting
brew "eza"             # Better ls (exa replacement)
brew "fd"              # Better find
brew "gh"              # GitHub CLI
brew "mas"             # Mac App Store CLI
brew "autoconf"
brew "bison"
brew "gettext"
brew "openssl"
brew "pkg-config"

# Enhanced tools
brew "lazygit"         # TUI git client
brew "git-delta"       # Better git diff pager
brew "zoxide"          # Smarter cd with learning
brew "mcfly"           # AI-powered history search
brew "pre-commit"      # Git hooks framework

# Development tools
brew "docker"
brew "docker-compose"

# Clojure development
brew "clojure/tools/clojure"  # Official Clojure CLI and deps.edn
brew "borkdude/brew/babashka" # Fast-starting Clojure scripting environment
brew "borkdude/brew/clj-kondo" # Clojure linter
# Neil not available in brew, install manually if needed
brew "borkdude/brew/jet"      # CLI to transform JSON/EDN/Transit
cask "chromedriver"           # For ClojureScript browser testing

# GUI Applications
cask "telegram"
cask "vlc"
cask "visual-studio-code"
cask "iterm2"
cask "rectangle"       # Window management
cask "alfred"          # Spotlight replacement
cask "cleanmymac"      # System cleaner

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

# Mac App Store apps
mas "Xcode", id: 497799835
mas "1Password 7", id: 1333542190
